data.azurerm_client_config.current: Reading...
azurerm_resource_group.example_rg: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMjI0ZWY0YS1hZjZhLTQ2YzAtOTc1Mi0zYWI2Mzk3NjEwM2Q7b2JqZWN0SWQ9NDQxMDI0OGMtMDg2OC00ODE0LWJhOTQtZDhmOGJjNTNhZTk5O3N1YnNjcmlwdGlvbklkPWJmMjIzM2JiLThiYzUtNGFkMC1hYmQ3LTM0MDE2MzM1NjY4Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.ContainerRegistry/registries/petDistriACR]
azurerm_mysql_flexible_server.mysql_server: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.DBforMySQL/flexibleServers/petclinicdbserver]
azurerm_kubernetes_cluster.aks_cluster: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.ContainerService/managedClusters/petDistriAKS]
azurerm_mysql_flexible_database.petclinic_db: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.DBforMySQL/flexibleServers/petclinicdbserver/databases/petclinic]
azurerm_role_assignment.aks_acr_role_assignment: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.ContainerRegistry/registries/petDistriACR/providers/Microsoft.Authorization/roleAssignments/17246a65-d082-9f06-ab0b-b651580d6ad3]
azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.KeyVault/vaults/kvPetDistri]
azurerm_key_vault_secret.db_connection_string: Refreshing state... [id=https://kvpetdistri.vault.azure.net/secrets/DB-Connection-String/7c36d0ca684b411ca6a0b1269a4dfc44]
azurerm_key_vault_secret.db_username: Refreshing state... [id=https://kvpetdistri.vault.azure.net/secrets/DB-Username/bfad069ba6024253a596aedf0610e971]
azurerm_key_vault_secret.db_password: Refreshing state... [id=https://kvpetdistri.vault.azure.net/secrets/DB-Password/6acc8176320a4153a93a5d0936b2825b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault_secret.db_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "db_connection_string" {
        id                      = "https://kvpetdistri.vault.azure.net/secrets/DB-Connection-String/7c36d0ca684b411ca6a0b1269a4dfc44"
        name                    = "DB-Connection-String"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster.aks_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks_cluster" {
        id                                  = "/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.ContainerService/managedClusters/petDistriAKS"
        name                                = "petDistriAKS"
      ~ tags                                = {
          ~ "environment" = "Dev" -> "Prod"
        }
        # (31 unchanged attributes hidden)

      - workload_autoscaler_profile {
          - keda_enabled                    = false -> null
          - vertical_pod_autoscaler_enabled = false -> null
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_mysql_flexible_server.mysql_server must be replaced
-/+ resource "azurerm_mysql_flexible_server" "mysql_server" {
      ~ fqdn                          = "petclinicdbserver.mysql.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/bf2233bb-8bc5-4ad0-abd7-340163356686/resourceGroups/petDistri/providers/Microsoft.DBforMySQL/flexibleServers/petclinicdbserver" -> (known after apply)
      ~ location                      = "westus" -> "eastus" # forces replacement
        name                          = "petclinicdbserver"
      ~ public_network_access_enabled = true -> (known after apply)
      ~ replica_capacity              = 10 -> (known after apply)
      ~ replication_role              = "None" -> (known after apply)
      - tags                          = {} -> null
        # (11 unchanged attributes hidden)

      ~ storage {
          ~ iops               = 360 -> (known after apply)
          ~ size_gb            = 20 -> 25
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ mysql_server_fqdn     = "petclinicdbserver.mysql.database.azure.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request CommentTerraform Plan Result -->